{
  "source": "Owners_manual.pdf",
  "pages": [
    98,
    99,
    100,
    101,
    102,
    103
  ],
  "chunks": [
    {
      "page": 98,
      "text": "The towing package includes a 2\" x 2\" (5 cm x 5 cm) hitch \nreceiver that can support an accessory carrier (for bicycles, \nskis, snowboards, etc.) or tow a trailer.\nInstalling and Using a Carrier\nWhen using the tow package to carry accessories, the 2\" x 2\" \n(5 cm x 5 cm) square hitch receiver is designed to support \nvertical loads of up to 160 lbs (72 kg). Ball mounts that are \ncompatible with the square receiver must be purchased \nseparately.\nTo install and use an accessory carrier, you must first attach \nthe ball mount to the hitch receiver (see Attaching and \nRemoving the Ball Mount on page 99). Then, follow the \ninstructions provided by your accessory carrier. Observe all \nregulations and legal requirements in your state or region \nthat apply to carrying accessories.\nThe Model Y towing package includes the wiring necessary \nfor using an accessory carrier equipped with lights (see \nElectrical Connections on page 100). The package also \nincludes Trailer Mode software compatibility (see Trailer \nMode on page 98).\nNOTE: Go to http://www.tesla.com to purchase accessories \nfor your vehicle. Although third-party products are available, \nTesla recommends and supports only Tesla-approved \nproducts (see Parts and Accessories on page 206). The \naccessory products available for your vehicle may vary based \non market region. Accessories sold on shop.tesla.com are \ncompatible with Model Y. Before attempting to install a non \nTesla-approved carrier, review the product information to \nensure compatibility.\nNOTE: When not in use, the ball mount should be removed \nand stored in a dry location to prevent dust and corrosion. \nKeep the dust cover over the hitch housing to prevent dirt \nand debris from entering (see Attaching and Removing the \nBall Mount on page 99).\nNOTE: Tesla assumes no responsibility for damage or injuries \nresulting from installing and using an accessory carrier, for \nany omissions in the instructions accompanying an accessory \ncarrier, or for your failure to follow the instructions. Damage \ncaused by using an accessory carrier is not covered by the \nwarranty.\nCarrying Accessories\nThe hitch receiver is designed to support vertical loads up to \n160 lbs (72 kg). When carrying bicycles, skis, or other items \non the Model Y hitch, always check to ensure that the \nmaximum weight is not exceeded. When calculating weight, \nremember to include the weight of the accessory carrier. \nKeep in mind that, when using any tow hitch carrying \naccessory (such as a bike rack), the tow hitch has a reduced \nmaximum vertical load capacity compared to towing a trailer \nbecause the accessory cargo is further from the hitch \nreceiver (more cantilevered) than a standard trailer ball \nmount connection.\nNOTE: Consult the product details of your accessory carrier \nfor more information, such as additional weight or load limits. \nDamage caused by non Tesla-approved accessories is not \ncovered by the warranty.\nCAUTION: Exceeding the maximum weight the Model Y \nhitch is designed to support (as previously described) \ncan cause significant damage.\nCAUTION: Do not attempt to install an accessory \ncarrier on Model Y that is not equipped with the tow \npackage. Doing so can cause significant damage.\nTrailer Towing\nThe maximum trailer weight (including all cargo and \nadditional equipment), and the trailer tongue weight depend \non the number of occupants in your vehicle and the tires \nbeing used. The maximum towing capacity and trailer tongue \nweight must never exceed the following:\nWheel/Rim Size\n# of Passengers\nMaximum \nTowing \nCapacity\nMaximum \nTongue Weight\n19\"\n5 or fewer\n3,500 lbs (1,588 \nkg)\n350 lbs (159 kg)\n20\"\n5 or fewer\n3,500 lbs (1,588 \nkg)\n350 lbs (159 kg)\n** You must operate within the speed limitations of your \ntrailer and tires, and only drive at speeds appropriate for the \nload you are towing, the weather, road and traffic conditions, \nand your level of towing experience. Always obey posted \nspeed limits and local regulations regarding speed.\nNOTE: In Canada, towing is limited to 55 mph (89 km/h).\nFor trailers with a combined loading of more than 1650 lbs \n(750 kg), Tesla recommends using a separate braking system \nwith an independent controller (see Trailer Brakes on page \n98). Carefully follow the instructions provided by the trailer \nbrake manufacturer to ensure that trailer brakes are properly \ninstalled, adjusted, and maintained.\nThe tongue weight is the downward force that the weight of \nthe trailer exerts on the hitch. This must not exceed 10% of \nthe maximum trailer weight. Carrying a significant amount of \nequipment, passengers, or cargo in the tow vehicle can \nreduce the towing capacity it can handle, which also reduces \nthe tongue weight. Maximum towing capacity is calculated \nassuming the GVWR (Gross Vehicle Weight Rating) is not \nexceeded (see Specifications on page 212).\nNOTE: If the information on the hitch label conflicts with the \ninformation provided in this Owner's Manual, this Owner's \nManual takes precedence.\nCAUTION: You should only use Model Y to tow if you \nhave experience and knowledge of how towing affects \nthe vehicle and are able to safely load, secure, and \nmaneuver the vehicle and cargo. Tesla's instructions \nare not all-inclusive of the knowledge and skills \nnecessary for safe towing. Damage caused by towing a \ntrailer is not covered by the warranty.\nTowing and Accessories\n96\n2025+ MODEL Y Owner's Manual\n"
    },
    {
      "page": 99,
      "text": "WARNING: Do not overload the vehicle or trailer. Doing \nso can cause poor performance, vehicle damage, and \nloss of vehicle control, resulting in serious injury.\nWARNING: Do not use the trailer hitch to transport \nModel Y (see Instructions for Transporters on page \n226).\nTire Pressures when Towing\nWhen towing a trailer, tire pressures must be adjusted to \naccommodate the additional load. 19\" and 20\" tires are \nacceptable to use for towing. Keep tires inflated to the \npressures shown below (if different, these pressures override \nthe pressures that are provided on the Tire and Loading \nInformation Label (see Vehicle Loading on page 213)).\nFront Tires\nRear Tires\nCold Tire Inflation Pressure\n255/45R19\n255/45R19\n42 psi (290 kPa)\n255/40R20\n255/40R20\n42 psi (290 kPa)\nCAUTION: Do not use Model Y for towing if equipped \nwith tires that are not listed previously.\nWARNING: Check tire pressures using an accurate \npressure gauge when tires are cold. Driving one \nmile/1.6 km warms the tires sufficiently to affect tire \npressures. Parking the vehicle in direct sunlight or in \nhot weather can also affect tire pressures. If you must \ncheck warm tires, expect increased pressures. Do not \nlet air out of warm tires in an attempt to match \nrecommended cold tire pressures. A hot tire at or \nbelow the recommended cold tire inflation pressure \nmay be dangerously under-inflated.\nWARNING: Never attempt to tow a trailer when a Model \nY tire is faulty or has been temporarily repaired (for \nexample, using a tire repair kit). A temporarily repaired \ntire is not designed to sustain the towing load. Towing \nusing a faulty or temporarily repaired tire can result in \ntire failure and loss of vehicle stability.\nBefore Towing a Trailer\nBefore towing a trailer, you must do the following:\n• Inflate tires to the cold tire inflation pressure specified in \nTire Pressures when Towing on page 97.\n• Observe all regulations and legal requirements that apply \nto trailer towing. Failure to comply with regulations can \ncompromise your safety.\n• Adjust side mirrors to provide a clear rear view without a \nsignificant blind spot.\n• Engage Trailer Mode (see Trailer Mode on page 98).\nConfirm the following:\n• Model Y rests horizontally with the trailer attached. If the \nvehicle is tipped up at the front and down at the rear, \ncheck that you are not exceeding the maximum towing \ncapacity and tongue loads provided in Trailer Towing on \npage 96.\n• Trailer lights (brake lights, turn signal lights, and marker \nlights) are working properly.\n• The trailer tongue is securely connected to the hitch ball.\n• Safety chains are properly connected between the trailer \nand the tow vehicle. Cross the safety chains under the \ntongue of the trailer to help prevent the tongue from \ncontacting the road if it separates from the hitch. Leave \nenough slack in the safety chains to allow for turns and \nensure that the chains do not drag on the ground.\n• All trailer hitch parts and attachments, safety chains, and \nelectrical connectors are in good condition and are \nproperly connected. If any problems are apparent, do not \ntow the trailer.\n• All cargo is secured.\n• Wheel chocks are available.\n• The trailer load is evenly distributed such that the trailer \ntongue weight is approximately 4-10% of the total trailer \nweight, without exceeding the maximum tongue weights \nprovided in Trailer Towing on page 96.\nCAUTION: Loads that are balanced over the trailer \nwheels or heavier in the rear can cause trailer sway, \nresulting in loss of vehicle control.\nWARNING: Always ensure that cargo is secured in the \ntrailer and will not shift. Dynamic load shifts can cause \nloss of vehicle control, resulting in serious injury.\nTowing Guidelines\nModel Y is designed primarily as a passenger-carrying \nvehicle. Towing a trailer puts additional load on the motor(s), \ndrive train, brakes, tires, and suspension and significantly \ndecreases range. If you decide to tow a trailer, proceed with \ncaution and follow these general guidelines:\n• Reduce your driving speed and avoid sudden maneuvers. \nWhen towing a trailer, steering, stability, turning radius, \nstopping distance and braking performance are different \nwhen compared to driving without a trailer.\n• Increase your following distance by maintaining at least \ntwice the distance from the vehicle ahead. This helps to \navoid situations that require heavy braking. Sudden \nbraking may result in skidding or jack-knifing, and loss of \ncontrol.\n• Avoid sharp turns. Sharp turns can cause the trailer to \ncontact the vehicle and cause damage. Keep in mind that \nthe trailer wheels are closer to the inside of the turn than \nthe vehicle’s wheels. Therefore, make wider turns to \nprevent the trailer from hitting curbs, road signs, trees or \nother objects.\nTowing and Accessories\n97\nDriving\n"
    },
    {
      "page": 100,
      "text": "• Periodically check the trailer lights and turn signals to \nconfirm that the bulbs are still working. When towing a \ntrailer, the turn signal arrows on the touchscreen flash as \nnormal, even if the bulbs on the trailer are burned out.\n• Periodically confirm the cargo is secure.\n• Regularly confirm that all towing components are securely \ntightened.\nWARNING: Towing requires you to increase your \nstopping distance. When towing, increase your \nfollowing distance and avoid situations that could \npotentially cause heavy braking. Failure to do so can \nresult in a collision.\nWARNING: Observe all regulations and legal \nrequirements in your jurisdiction that apply specifically \nto trailer towing. Failure to comply with regulations can \ncompromise your safety.\nTrailer Mode\nTrailer Mode must always be active when towing a trailer. \nWhen you connect a trailer’s electrical connection while the \nvehicle is in Park, Model Y automatically engages Trailer \nMode. When you disconnect the trailer’s electrical \nconnection, Trailer Mode does not automatically disengage. \nTo manually engage or disengage Trailer Mode, touch \nControls > Dynamics > Trailer Mode on the touchscreen. One \nof the following indicators displays:\nTrailer Mode is active.\nModel Y detects a connection for trailer lights \nbut Trailer Mode is disabled. It is likely that a \ncarrying accessory has been connected.\nModel Y detects a faulty electrical connection \nfor the trailer lights. Some, or all, trailer lights \nmay not be functioning. Pull over as soon as \nsafety permits and inspect the trailer lights for \nfaulty cabling or connections. If the issues are \nresolved and the red icon still persists, disable \nand re-enable Trailer Mode once more.\nSome Autopilot features, as well as rear parking sensor \nfunctionality, may not be available when Trailer Mode is \nenabled. In addition, these features operate differently:\n• Traffic-Aware Cruise Control increases the following \ndistance from the vehicle in front of you.\n• Side collision warnings are active but automatic steering \ninterventions are disabled.\n• The braking force provided by Automatic Emergency \nBraking (see Collision Avoidance Assist on page 137) \nmay be limited. Therefore, stopping distance may \nincrease.\nWARNING: Do not rely on Model Y to detect the trailer \nand automatically engage Trailer Mode. Always check \nto ensure Trailer Mode is engaged before towing a \ntrailer.\nWARNING: Under no circumstances should you exit \nTrailer Mode when towing a trailer. Doing so can cause \nserious injury.\nTrailer Brakes\nWhen towing a loaded trailer that weighs more than 1650 lbs \n(750 kg), Tesla recommends that the trailer be equipped with \nits own brake system adequate for the weight of the trailer. \nEnsure compliance with local regulations. A brake controller \nmust be purchased separately, and the required 4-pin pigtail \nconnector can be ordered from Tesla Service.\nFollow these steps to connect a brake controller:\n1. Connect the wiring on the brake controller to the \nappropriate locations on the 4-pin pigtail connector.\n2. Remove the cover located under the dashboard in the \ndriver’s side footwell.\nTowing and Accessories\n98\n2025+ MODEL Y Owner's Manual\n"
    },
    {
      "page": 101,
      "text": "3. Peel back the carpet to expose the vehicle's 4-pin \nconnector on the wiring harness.\n4. Connect the pigtail connector to the vehicle wiring \nconnector.\nWARNING: Towing increases your stopping distance, \neven when the trailer is equipped with its own braking \nsystem. When towing, increase your following distance \nand avoid situations that could potentially cause heavy \nbraking. Failure to do so can cause a collision.\nWARNING: Observe all regulations and legal \nrequirements in your regional and national jurisdictions \nthat apply specifically to trailer towing and brake \nrequirements. Many regions require a breakaway \nswitch, located on the tongue of the trailer, to activate \nthe trailer brakes in the event that the trailer separates \nfrom the vehicle. Failure to comply with regulations can \ncompromise your safety.\nWARNING: Follow the instructions provided by the \ntrailer brake manufacturer to ensure that trailer brakes \nare properly installed, adjusted, and maintained. Tesla \nis not responsible for damages caused by incorrect \ninstallation of trailer braking systems.\nParking with a Trailer\nWhenever possible, avoid parking on a grade. However, if \nparking on a grade is absolutely necessary, place wheel \nchocks under the trailer wheels. Consider having someone \nhelp you with these steps:\n1. One person presses and holds the brake pedal.\n2. A second person places the wheel chocks under the \nwheels on the downgrade side of the vehicle's tires.\n3. When the chocks are in place, release the brake pedal and \nensure the chocks hold the weight of the vehicle and \ntrailer.\nNOTE: When testing chocks, ensure that Vehicle Hold \n(see Vehicle Hold on page 88) is not engaged. If Vehicle \nHold is braking Model Y, the Vehicle Hold indicator light \ndisplays on the touchscreen. To disengage Vehicle Hold, \npress and release the brake pedal.\n4. Place the vehicle in Park.\nWARNING: If parking on a grade is necessary, always \nensure that all trailer wheels have been securely \nchocked. Failure to do so can result in serious damage \nor injury.\nTrailer Sway Mitigation\nWhen trailer sway is detected, the electronic stability control \nsystem attempts to apply the appropriate amount of braking \nto minimize trailer sway. The touchscreen briefly displays the \ntraction control system indicator. Pressing the brake pedal \nwhen the system is actively braking to mitigate trailer sway \ndoes not cancel this automatic braking.\nAttaching and Removing the Ball Mount\nThe Model Y towing package does not include a ball mount. \nYou must purchase a ball mount suitable for the type of trailer \nyou are towing. The Model Y hitch receiver supports a ball \nmount with a length of up to 8.5” (22 cm) and a rise of up to \n0.75” (2 cm). Do not use any type of drop ball mount that \ndoes not meet these requirements.\nTowing and Accessories\n99\nDriving\n"
    },
    {
      "page": 102,
      "text": "To attach a ball mount:\n1. Model Y has 2 push clips that secure the dust cover to the \nvehicle. Use a thin object, such as a flat screwdriver, to \ntwist and pry the clips open. Remove the dust cover and \nstore it in a safe location.\n2. If necessary, remove the cotter pin from the locking bolt \nand slide the locking bolt out of the hitch assembly.\n3. Slide the ball holder into the hitch assembly.\n4. Align the hole in the ball holder with the one in the hitch \nassembly.\n5. Slide the locking bolt through the hitch assembly/ball \nholder.\n6. Insert the cotter pin in the hole at the end of the locking \nbolt.\nTo remove a ball mount:\n1. Remove the cotter pin from the locking bolt and slide the \nlocking bolt out of the ball holder/hitch assembly.\n2. Pull the ball holder out of the hitch assembly.\n3. Re-install the dust cover for the hitch housing and store \nthe ball mount in a secure location.\nNOTE: When driving through high waters, the dust cover may \nunclasp to relieve pressure. When parked in a safe location, \nsimply re-clasp the dust cover back onto the vehicle.\nElectrical Connections\nRegulations require all trailers to be equipped with tail lights, \nbrake lights, side marker lights, and turn signals. To provide \npower for trailer lighting, a built-in 7-pin wiring connector is \nprovided near the hitch support's wiring plugs for most types \nof trailers. Plugging in trailer wiring into the Model Y \nelectrical connector automatically engages Trailer Mode (see \nTrailer Mode on page 98). It is the driver’s responsibility to \nensure that all electrical connections are working and all \ntrailer lights are operating before and during towing. You \nmust perform manual checks.\n1. Reverse Lights\n2. Brake Controller Output\n3. Right Turn Signal and Brake Light\n4. Low Voltage Power (if equipped)\n5. Ground\n6. Left Turn Signal and Brake Light\n7. Tail Lamps\nTowing and Accessories\n100\n2025+ MODEL Y Owner's Manual\n"
    },
    {
      "page": 103,
      "text": "Loss of trailer lights when towing may be the result of a fault \nin the trailer wiring or excessive power consumption by the \nlights connected to the trailer output(s). When this occurs, a \nred Trailer Mode icon appears on the touchscreen. Fix any \nissues with the wiring and/or reduce the number of lights \nconnected to the trailer output(s), then toggle Trailer Mode \noff and on again.\nCAUTION: Always ensure that the trailer electrical \ncable does not contact or drag on the ground and there \nis enough slack in the cable to allow for turns.\nWARNING: Use only the electrical connections \ndesigned by Tesla. Do not attempt to directly splice or \nattempt to connect a trailer’s electrical wiring using \nany other method. Doing so can damage the vehicle's \nelectrical system and cause malfunctions.\nImpact on Range\nTowing a trailer increases vehicle weight and drag. As a \nresult, driving range can decrease significantly. Although Trip \nPlanner (if available in your market region) attempts to adjust \nestimates based on Trailer Mode, actual energy consumption \nmay vary. Plan trip length and charging destinations \naccordingly.\nTowing and Accessories\n101\nDriving\n"
    }
  ]
}